about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-01 Sat 16:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org1038b77" class="outline-2">
<h2 id="org1038b77">about</h2>
<div class="outline-text-2" id="text-org1038b77">
<p>
Hello! I'm Yavuz, a Computer Engineering student at McMaster University who likes building things that actually work; whether that’s a cloud-deployed web app, a working PCB, or a machine learning pipeline inside a materials lab.
</p>

<p>
Right now, I split my time between developing full-stack projects (Next.js, Supabase, Docker, CI/CD) and researching thermoelectric materials using MODEM, a machine learning + design of experiments platform I help optimize in Dr. Mozharivskyj’s group.
</p>

<p>
I enjoy working end-to-end: writing the code, wiring the hardware, deploying it, debugging it, and making sure it scales. I’m currently looking for co-op roles where I can keep doing exactly that, building useful systems with like minded people!
</p>

<p>
You can catch me climbing, playing soccer, or optimizing my emacs.
Shoot me an email: yavuzselimafacan@gmail.com
</p>

<p class="footer-note">built with Emacs Org to HTML and Github Pages to Cloudflare</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">y.s.a, updated: 2025-11-01 Sat 16:05</p>
</div>
</body>
</html>
